# merge ,concate ,join.

In [3]:
import pandas as pd
df1=pd.DataFrame({'id':[1,2,3,4,5],
                 'name':['alex','ron','ben','bob','sid']})
df2=pd.DataFrame({'id':[1,2,3,4,5],
                 'age':[21,19,20,22,21]})

In [6]:
# merge dataframe on the basis of id
merge_df=pd.merge(df1,df2,on='id',how='inner')
print(merge_df)

   id  name  age
0   1  alex   21
1   2   ron   19
2   3   ben   20
3   4   bob   22
4   5   sid   21

In [8]:
#concate the dataframe
concate_data=pd.concat([df1,df2],axis=1)
print(concate_data)

   id  name  id  age
0   1  alex   1   21
1   2   ron   2   19
2   3   ben   3   20
3   4   bob   4   22
4   5   sid   5   21

In [11]:
d={'id':[1,2,3,4,5],
  'val':['a','b','c','d','e']}
a=pd.DataFrame(d)
b={'id':[1,2,8,7,6],
  'val':['a','b','s','r','q']}
c=pd.DataFrame(b)

In [14]:
#left outer join
df=pd.merge(a,c,on='id',how='left')
print(df)

   id val_x val_y
0   1     a     a
1   2     b     b
2   3     c   NaN
3   4     d   NaN
4   5     e   NaN

In [18]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering',
                              'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df3 = pd.merge(df1, df2)
display(df1,df2,df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [19]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
display(df3, df4, pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [22]:
import pandas as pd
# Creating two DataFrames with matching data and columns
df1 = pd.DataFrame([['a', 'b'], ['d', 'f']], index=['X', 'A'], columns=['P', 'Q'])
df2 = pd.DataFrame([[1, 2], [4, 5]], index=['X', 'Y'], columns=['S', 'T'])

display(df1, df2)
# Joining df1 and df2 based on the index
result = df1.join(df2) 
display("Result df1.join(df2):", result)

   P  Q
X  a  b
A  d  f

   S  T
X  1  2
Y  4  5

'Result df1.join(df2):'

   P  Q    S    T
X  a  b  1.0  2.0
A  d  f  NaN  NaN

In [23]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
display(df6, df7, pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

   name   food drink
0  Mary  bread  wine

In [25]:
display(df6, df7, pd.merge(df6, df7, how='outer'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [26]:
data = ['peter', 'Paul', 'MARY', 'gUIDO']
[s.capitalize() for s in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [30]:
df3=df1.join(df2,lsuffix='_left',rsuffix='_right',how='inner')
print(df3)

   P  Q  S  T
X  a  b  1  2

In [31]:
import numpy as np
x = np.array([2, 3, 5, 7, 11, 13])
x * 2

array([ 4,  6, 10, 14, 22, 26])

In [32]:
data = ['peter', 'Paul', 'MARY', 'gUIDO']
[s.capitalize() for s in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [33]:
data = ['peter', 'Paul', None, 'MARY', 'gUIDO']
[s if s is None else s.capitalize() for s in data]

['Peter', 'Paul', None, 'Mary', 'Guido']

In [34]:
import pandas as pd
names = pd.Series(data)
names.str.capitalize()

0    Peter
1     Paul
2     None
3     Mary
4    Guido
dtype: object

In [37]:
m = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                   'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [38]:
print(m)

0    Graham Chapman
1       John Cleese
2     Terry Gilliam
3         Eric Idle
4       Terry Jones
5     Michael Palin
dtype: object

In [42]:
# string based operation
# exercise1)create a string made up fist, middle,last characters
i= "example"
first = i[0]
middle_index = len(i) // 2
middle = i[middle_index]
last = i[-1]
result = first + middle + last
print("The new string is:", result)

The new string is: eme